README.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline author:t broken-links:nil
#+OPTIONS: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t
#+OPTIONS: todo:t |:t
#+TITLE: README
#+DATE: <2017-12-08 Fri>
#+AUTHOR: Gregory Grubbs
#+EMAIL: gregoryg@cloudera.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.3.1 (Org mode 9.1.3)
#+SETUPFILE: https://raw.githubusercontent.com/fniessen/org-html-themes/master/setup/theme-readtheorg.setup

* CIM-demos
  Demos Created by Cloud and Infrastructure SE Specialization

** Environment and database Setup for demos
 SET UP User for cluster (usually =centos= or =gregj=)

 #+NAME: variables-table
 | ! | sudouser | cloud | userdir      |
 |---+----------+-------+--------------|
 | # | gregj    | gcp   | /user/gregj/ |
 #+TBLFM: @2$4= '(concat "/user/" @2$2 "/")


*** Scripts to run
**** Set up basics of environment
 #+BEGIN_SRC sh :shebang "#!/bin/bash" :results none :tangle ingest/01-setup-environment.sh :comments link :var USER=variables-table[2,1]
   sudo yum -y install epel-release
   sudo yum -y install python-pip wget curl telnet finger mlocate jq htop net-tools git
   sudo pip install cm-api

   echo "Setting up HDFS home data dir for user ${USER}"
   sudo -u hdfs hdfs dfs -mkdir -p /user/${USER}/data
   sudo -u hdfs hdfs dfs -chown -R ${USER} /user/${USER}

   cmhost=`grep server_host= /etc/cloudera-scm-agent/config.ini |cut -d '=' -f2-`
   if [ -z "$cmhost" ] ; then
       echo "Error: Cannot determine Cloudera Manager host address - does this host run Cloudera Manager Agent?"
       exit 1
   fi
   echo Cloudera Manager is running on $cmhost

   # get cluster name
   clustername=$(curl --silent -X GET -u admin:admin http://$cmhost:7180/api/v14/clusters | jq -r '.items[].name')
   if [ 1 != `echo $clustername | wc -l` ] ; then
       echo "Error: I can only deal with 1 cluster managed by the CM - found: `echo $clustername`"
       exit 1
   fi

   # get version of cluster
   cdhversion=$(curl --silent -u admin:admin http://${cmhost}:7180/api/v14/clusters/${clustername}|jq -r '.fullVersion')
   cdhmajor=$(echo ${cdhversion} | cut -d'.' -f1)
   cdhminor=$(echo ${cdhversion} | cut -d'.' -f2)

   echo "Setting up defaults for impala-shell and Beeline"
   impalad=$(curl --silent -u "admin:admin" "http://$cmhost:7180/api/v14/hosts?view=FULL" | jq -r '[.items[] | select(.roleRefs[].roleName | contains("-IMPALAD")) | .ipAddress] | first ')
   echo "[impala]
   impalad=${impalad}:21000
       " > ~/.impalarc
   hiveserver2=$(curl --silent -u 'admin:admin' http://${cmhost}:7180/api/v14/hosts?view=full | jq -r '[.items[] | select(.roleRefs[].roleName | contains("HIVESERVER2")) .hostname] | first')
   # start up a beeline command and then save config to ~/.beeline/beeline.properties
   beeline -u "jdbc:hive2://${hiveserver2}:10000/default" -n ${USER} <<EOF
   !save
   !quit
   EOF

   echo "To run beeline without parameters, use 'beeline -r'"

   echo "Fixing up .bashrc"
   sudo yum -y install cowsay fortune-mod
   tee -a ~/.bashrc <<EOF
   export PS1='\u@gateway: \w #$ '
   if [[ \$- =~ "i" ]] ; then
       # echo "Streamsets URL: http://`hostname -f`:18630/"
       # echo "Jupyter notebook URL: http://`hostname -f`:8880"
       # echo "RStudio URL: http://`hostname -f`:8787"
       ~/bin/cowme
   fi
   EOF
   mkdir -p ~/bin
   tee ~/bin/cowme << EOF
   #!/bin/bash
   if type fortune cowsay >/dev/null
   then
       IFS=',' read -r -a cowopts <<< "b,g,p,s,t,w,y"
       if [ \$((RANDOM % 4)) == 0 ] ; then
           cowcmd="cowsay"
       else
           cowcmd="cowthink"
       fi
       fortune -s | \${cowcmd} -\${cowopts[\$((RANDOM % \${#cowopts[@]}))]}
   fi
   EOF
   chmod 755 ~/bin/cowme
 #+END_SRC
**** Script to load them all  
#+BEGIN_SRC sh :shebang "#!/bin/bash" :results none :tangle ingest/02-load-all-demos.sh :var USERDIR=variables-table[2,3]
  ## This script does the following:
  ##  1. Set up external raw S3 and optimized local Hive tables for Hive Benchmark dataset
  ##  2. Do the same for the Utility data set
  ##  3. Set up Data Journey demo (retail dataset)
  echo Setting up Bay Area Bikeshare
  impala-shell --var=USERDIR=${USERDIR} -f impala/99-setup-bay-area-bicycle-share.sql

  echo Setting up Hive Benchmark data sets
  impala-shell --var=USERDIR=${USERDIR} -f impala/99-setup-hive-benchmark.sql

  echo Setting up the Utility data sets
  impala-shell --var=USERDIR=${USERDIR} -f impala/99-setup-utility.sql

  echo Setting up NYC Taxi/Uber raw data
  impala-shell --var=USERDIR=${USERDIR} -f impala/99-setup-nyc-taxi.sql
  echo Setting up the Data Journey data sets

  echo "CREATE DATABASE IF NOT EXISTS retailer LOCATION 's3a://gregoryg/database/retailer/';" | tee impala/99-setup-data-journey.sql
  for i in `hdfs dfs -ls -R s3a://gregoryg/database/retailer/|grep parq|tr -s ' '|cut -d' ' -f8`
  do
      dirpath=`echo $i | sed 's,[^/]\+parq$,,'`
      tablename=`basename $dirpath`
      echo "CREATE EXTERNAL TABLE IF NOT EXISTS retailer.$tablename LIKE PARQUET '"$i"' STORED AS PARQUET LOCATION '"$dirpath"';" | tee -a impala/99-setup-data-journey.sql
  done
  impala-shell -f impala/99-setup-data-journey.sql
  # echo Setting up Observations and Permutations data sets
  # impala-shell --var=USERDIR=${USERDIR} -f 99-setup-impala-problem.sql
#+END_SRC
** All Demos
**** Retail Data Journey
 The =retailer= database is created in  =02-load-all-demos.sh= 

 Hue notebook: [[file:notebooks/hue/Data Journey - Retail.json][Data Journey - Retail]]
**** BABS - Bay Area Bike Share dataset
     Hue notebook: [[file:notebooks/hue/Bay Area BikeShare.json][Bay Area BikeShare notebook]]

     Raw data:  s3a://gregoryg/babs
    
     This demo follows this blog post: [[http://gethue.com/bay-area-bike-share-data-analysis-with-spark-notebook-part-2/][Bay Area bike share analysis with the Hadoop Notebook and Spark & SQL]]

     To set up this demo:
       + Create external Hive tables and optimized tables
       + Load Hue notebook

    You will not need to clean any data for this demo - From the raw dataset, I found the
    rebalancing/status data to be problematic.  It uses lots of unnecessary quoting, and
    has three different timestamp formats.  The data was cleaned with simple shell before
    being uploaded to S3:

 #+BEGIN_SRC shell
   cat 201508_status_data.csv | tr -d '"' > cleaned_201508_status_data.csv 
   cat 201408_status_data.csv |tr -d '"' > cleaned_201408_status_data.csv 
   cat 201402_status_data.csv |tr -d '"' | sed 's,/,-,g' > cleaned_201402_status_data.csv 
 #+END_SRC

 #+BEGIN_SRC sql :results none :tangle ingest/impala/99-setup-bay-area-bicycle-share.sql :comments link
   -- can be run as Impala
   -- Bay Area Bicycle Share (BABS) dataset
     CREATE DATABASE IF NOT EXISTS bikeshare;
     USE bikeshare;

     CREATE EXTERNAL TABLE bikeshare.station_raw (
        station_id BIGINT,
        name STRING,
        lat DOUBLE,
        long DOUBLE,
        dockcount BIGINT,
        landmark STRING,
        installation STRING )
        ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
        STORED AS TEXTFILE LOCATION 's3a://gregoryg/babs/station'
        TBLPROPERTIES ('numRows'='-1', 'rawDataSize'='-1', 'skip.header.line.count'='1' );

     CREATE EXTERNAL TABLE IF NOT EXISTS bikeshare.rebalancing_raw (
        station_id BIGINT,
        bikes_available BIGINT,
        docks_available BIGINT,
        time_recorded STRING ) 
     ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
     STORED AS TEXTFILE
     LOCATION 's3a://gregoryg/babs/rebalancing'
     TBLPROPERTIES ('numRows'='-1', 'rawDataSize'='-1', 'skip.header.line.count'='1');

     CREATE EXTERNAL TABLE bikeshare.trip_raw (
        trip_id BIGINT,
        duration BIGINT,
        date_start STRING,
        start_station STRING,
        start_terminal BIGINT,
        date_end STRING,
        end_station STRING,
        end_terminal BIGINT,
        bike_num BIGINT,
        subscription_type STRING,
        zip STRING )
        ROW FORMAT DELIMITED FIELDS TERMINATED BY ',' 
        STORED AS TEXTFILE
        LOCATION 's3a://gregoryg/babs/trip'
        TBLPROPERTIES ('numRows'='-1', 'rawDataSize'='-1', 'skip.header.line.count'='1');

     CREATE EXTERNAL TABLE bikeshare.weather_raw (
        `date` STRING,
        max_temperature_f BIGINT,
        mean_temperature_f BIGINT,
        min_temperaturef BIGINT,
        max_dew_point_f BIGINT,
        meandew_point_f BIGINT,
        min_dewpoint_f BIGINT,
        max_humidity BIGINT,
        mean_humidity BIGINT,
        min_humidity BIGINT,
        max_sea_level_pressure_in DOUBLE,
        mean_sea_level_pressure_in DOUBLE,
        min_sea_level_pressure_in DOUBLE,
        max_visibility_miles BIGINT,
        mean_visibility_miles BIGINT,
        min_visibility_miles BIGINT,
        max_wind_speed_mph BIGINT,
        mean_wind_speed_mph BIGINT,
        max_gust_speed_mph BIGINT,
        precipitation_in BIGINT,
        cloud_cover BIGINT,
        events STRING,
        wind_dir_degrees BIGINT,
        zip STRING )
        ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
        STORED AS TEXTFILE LOCATION 's3a://gregoryg/babs/weather'
        TBLPROPERTIES ('numRows'='-1', 'rawDataSize'='-1', 'skip.header.line.count'='1');

     -- Create optimized tables
     create table IF NOT EXISTS bikeshare.rebalancing
     STORED AS parquet
     AS select
         CAST(station_id AS int) AS station_id,
         CAST(bikes_available AS int) AS bikes_available,
         CAST(docks_available AS int) AS docks_available,
         CAST(time_recorded AS timestamp) AS time_recorded,
         time_recorded AS original_timestring
     FROM bikeshare.rebalancing_raw;

     create table IF NOT EXISTS bikeshare.trip
     STORED AS parquet
     AS SELECT
        CAST(trip_id AS INT) AS trip_id,
        CAST(duration AS INT) AS duration,
        CAST( concat(split_part(split_part(date_start, '/', 3), ' ' , 1), '-',
          lpad(split_part(date_start, '/', 1), 2, '0'), '-',
          lpad(split_part(date_start, '/', 2), 2, '0'), ' ',
          lpad(split_part(date_start, ' ', 2), 5, '0'), ':00') AS timestamp) AS date_start,
        start_station,
        CAST(start_terminal AS INT) AS start_terminal,
        CAST( concat(split_part(split_part(date_end, '/', 3), ' ' , 1), '-',
          lpad(split_part(date_end, '/', 1), 2, '0'), '-',
          lpad(split_part(date_end, '/', 2), 2, '0'), ' ',
          lpad(split_part(date_end, ' ', 2), 5, '0'), ':00') AS timestamp) AS date_end,
        end_station,
        CAST(end_terminal AS INT) AS end_terminal,
        CAST(bike_num AS INT) AS bike_num,
        subscription_type,
        zip
       FROM bikeshare.trip_raw;

       CREATE TABLE IF NOT EXISTS bikeshare.station
       STORED AS parquet
       AS SELECT
          CAST(station_id AS INT) AS station_id,
          name,
          lat,
          long,
          CAST(dockcount AS INT) AS dockcount,
          landmark,
          installation
       FROM bikeshare.station_raw;

       CREATE TABLE IF NOT EXISTS bikeshare.station
       STORED AS parquet
       AS SELECT
          CAST(station_id AS INT) AS station_id,
          name,
          lat,
          long,
          CAST(dockcount AS INT) AS dockcount,
          landmark,
          installation
       FROM bikeshare.station_raw;

       CREATE TABLE IF NOT EXISTS bikeshare.weather
       STORED AS parquet
       AS SELECT
       CAST( concat( split_part(`date`, '/', 3), '-',
          lpad(split_part(`date`, '/', 1), 2, '0'), '-',
          lpad(split_part(`date`, '/', 2), 2, '0')) AS timestamp) AS date_recorded,
        CAST(max_temperature_f AS INT) AS max_temperature,
        CAST(mean_temperature_f AS INT) AS mean_temperature_f,
        CAST(min_temperaturef AS INT) AS min_temperaturef,
        CAST(max_dew_point_f AS INT) AS max_dew_point_f,
        CAST(meandew_point_f AS INT) AS meandew_point_f,
        CAST(min_dewpoint_f AS INT) AS min_dewpoint_f,
        CAST(max_humidity AS INT) AS max_humidity,
        CAST(mean_humidity AS INT) AS mean_humidity,
        CAST(min_humidity AS INT) AS min_humidity,
        max_sea_level_pressure_in,
        mean_sea_level_pressure_in,
        min_sea_level_pressure_in,
        CAST(max_visibility_miles AS INT) AS max_visibility_miles,
        CAST(mean_visibility_miles AS INT) AS mean_visibility_miles,
        CAST(min_visibility_miles AS INT) AS min_visibility_miles,
        CAST(max_wind_speed_mph AS INT) AS max_wind_speed_mph,
        CAST(mean_wind_speed_mph AS INT) AS mean_wind_speed_mph,
        CAST(max_gust_speed_mph AS INT) AS max_gust_speed_mph,
        CAST(precipitation_in AS INT) AS precipitation_in,
        CAST(cloud_cover AS INT) AS cloud_cover,
        events,
        CAST(wind_dir_degrees AS INT) AS wind_dir_degrees,
        zip
        FROM bikeshare.weather_raw;

 #+END_SRC

 After all tables have been created, upload the BABS notebook into Hue
     + [[file:notebooks/hue/Bay Area BikeShare.json][Bay Area BikeShare notebook]]

 The pyspark code below can be run in CDSW (incomplete as of <2017-12-06 Wed>)


 #+BEGIN_SRC python
   # ### Create a Spark Session
   from pyspark.sql import SparkSession, SQLContext
   from pyspark.sql.types import *


   spark = SparkSession.builder.appName("Bay Area Bikeshare").getOrCreate()
   sc = spark.sparkContext
   sqlContext = SQLContext(sc)

   schema = StructType(
       [
       StructField("trip_id", IntegerType(), True),
       StructField("duration", IntegerType(), True),
       StructField("date_start", TimestampType(), True),
       StructField("start_station", StringType(), True),
       StructField("start_terminal", IntegerType(), True),
       StructField("date_end", TimestampType(), True),
       StructField("end_station", StringType(), True),
       StructField("end_terminal", IntegerType(), True),
       StructField("bike_num", IntegerType(), True),
       StructField("subscription_type", StringType(), True),
       StructField("zip", StringType(), True)])

   trips = sc.textFile('/user/gregj/data/babs/trip/201402_trip_data.csv')

   trips = trips.map(lambda line: line.split(","))

   station_70 = trips.filter(lambda x: x[4] == '70')

   # Emit tuple of ((date, hour), 1)
   trips_by_day_hour = station_70.map(lambda x: ((x[2].split()[0], x[2].split()[1].split(':')[0]), 1))

   trips_by_day_hour = trips_by_day_hour.reduceByKey(lambda a, b: a+b)

   # Emit tuple of (hour, count)
   trips_by_hour = trips_by_day_hour.map(lambda x: (int(x[0][1]), x[1]))

   avg_trips_by_hour = trips_by_hour.combineByKey( (lambda x: (x, 1)), 
                                                   (lambda x, y: (x[0] + y, x[1] + 1)), 
                                                       (lambda x, y: (x[0] + y[0], x[1] + y[1])) 
                                                       )
   avg_trips_by_hour = avg_trips_by_hour.mapValues(lambda v : v[0] / v[1]) 

   avg_trips_sorted = sorted(avg_trips_by_hour.collect())
   %table avg_trips_sorted
 #+END_SRC
