README.org
**** Utility data
 #+BEGIN_SRC sql :results none :tangle ingest/impala/99-setup-utility.sql :comments link
   create database IF NOT EXISTS utility;
   use utility;

   CREATE EXTERNAL TABLE IF NOT EXISTS meterdata_raw (
          LocationName string,
          MeterName    string,
          ChannelName  string,
          IntervalReadDateTime string,
          IntervalReadRawValue float
          )
          COMMENT 'Meter Data using raw .csv files'
          ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
          STORED AS TEXTFILE
          LOCATION 's3a://gregoryg/utility/cdata/ds2/raw/MeterData';


   CREATE EXTERNAL TABLE IF NOT EXISTS rateplan_raw (
          LocationName string,
          AccountName string,
          RateplanName string,
          RatePlanDate string
          )
          COMMENT 'Rate plan using raw .csv files'
          ROW FORMAT DELIMITED FIELDS TERMINATED BY '\t'
          STORED AS TEXTFILE
          LOCATION 's3a://gregoryg/utility/cdata/ds2/raw/RateplanData';

   CREATE EXTERNAL TABLE IF NOT EXISTS register_raw (
          LocationName string,
          MeterName string,
          RegisterTypeName string,
          RegisterReadDate string,
          RegisterReadValue float
          )
          COMMENT 'Register data using raw .csv files'
          ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
          STORED AS TEXTFILE
          LOCATION 's3a://gregoryg/utility/cdata/ds2/raw/RegisterData';

   CREATE EXTERNAL TABLE IF NOT EXISTS multiplier_raw (
          LocationName string,
          MeterName string,
          RegisterTypeName string,
          ApplicationTypeCode string,
          RegisterReadDate string,
          MultiplierFactor string
          )
          COMMENT 'Multiplier data using raw .csv files'
          ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
          STORED AS TEXTFILE
          LOCATION 's3a://gregoryg/utility/cdata/ds2/raw/MultiplierData';

   CREATE EXTERNAL TABLE IF NOT EXISTS weather_raw (
          AmbientYear int,
          AmbientMonth int,
          AmbientDay int,
          AmbientHour int,
          AmbientDate string,
          WetBulbTemp double,
          DryBulbTemp double,
          BarometricPressure double,
          Precipitation double,
          RelativeHumidity double
          )
          COMMENT 'Weather data using raw .csv files'
          ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
          STORED AS TEXTFILE
          LOCATION 's3a://gregoryg/utility/cdata/ds2/raw/WeatherData';


   CREATE TABLE IF NOT EXISTS meterdata STORED AS PARQUET
          AS SELECT cast(substring(LocationName, 12) AS int) AS LocationName,
                    cast(substring(MeterName, 8) AS int) AS MeterName,
                    ChannelName,
                    cast(IntervalReadDateTime AS timestamp) AS IntervalReadDateTime,
                    IntervalReadRawValue
             FROM meterdata_raw
             WHERE LocationName <> 'LocationName';

   CREATE TABLE IF NOT EXISTS multiplier STORED AS PARQUET
          AS SELECT cast(substring(LocationName, 12) AS int) AS LocationName,
                    cast(substring(MeterName, 11) AS int) AS MeterName,
                    RegisterTypeName,
                    ApplicationTypeCode,
                    cast(RegisterReadDate AS timestamp) AS RegisterReadDate,
                    cast(MultiplierFactor AS decimal(9,4)) AS MultiplierFactor
             FROM multiplier_raw
             WHERE LocationName <> 'LocationName';

   CREATE TABLE IF NOT EXISTS rateplan STORED AS PARQUET
          AS SELECT cast(substring(LocationName, 12) AS int) AS LocationName,
                    cast(substring(AccountName, 11) AS int) AS AccountName,
                    RatePlanName,
                    cast(RatePlanDate AS timestamp) AS RatePlanDate
             FROM rateplan_raw
             WHERE LocationName <> 'LocationName';

   CREATE TABLE IF NOT EXISTS register STORED AS PARQUET
          AS SELECT cast(substring(LocationName, 12) AS int) AS LocationName,
                    cast(substring(MeterName, 11) AS int) AS MeterName,
                    RegisterTypeName,
                    cast(RegisterReadDate AS timestamp) AS RegisterReadDate,
                    cast(RegisterReadValue AS decimal(9,2)) AS RegisterReadValue
             FROM register_raw
             WHERE LocationName <> 'LocationName';

   CREATE TABLE IF NOT EXISTS weather STORED AS PARQUET
          AS SELECT * FROM weather_raw
          WHERE AmbientDate <> 'AmbientDate';
 #+END_SRC

**** Connected Car Demo: Impala, Kudu, Streamsets and so much more
 #+BEGIN_SRC sh :shebang "#!/bin/bash" :results:none  :tangle ingest/03-setup-connected-car.sh
   ## TODO: Add Anaconda parcel setup
   ###  https://repo.continuum.io/pkgs/misc/parcels/
   ### curl -u "admin:admin" "http://${cmhost}:7180/api/v14/cm/config?view=full" |jq '{ "items": [.items[] | if .name=="REMOTE_PARCEL_REPO_URLS" then .value=.value + ",https://repo.continuum.io/pkgs/misc/parcels/" else . end]}'  > /tmp/gort2.json
   ### curl --silent -X PUT -H "Content-Type:application/json" -u "admin:admin" -d /tmp/gort.json

   # if [ -z ${SSH_AUTH_SOCK} ] ; then
   #     echo "SSH agent forwarding is not active in this shell session."
   #     echo "Agent forwarding is required to install the Streamsets parcel on the CM host."
   #     exit 1
   # fi

   # echo "Pulling cdh-projects, including the lovely notebooks/ subdirectory"
   # cd
   # git clone git@github.com:gregoryg/cdh-projects.git

   # echo "Now setting up Streamsets"
   # cd
   # wget -q 'https://archives.streamsets.com/datacollector/2.2.1.0/rpm/streamsets-datacollector-2.2.1.0-all-rpms.tgz'
   # tar -xzf streamsets-datacollector-2.2.1.0-all-rpms.tgz
   # sudo yum -y localinstall streamsets*.rpm
   # rm streamsets-datacollector-2.2.1.0-all-rpms.tgz streamsets*.rpm
   # sudo service sdc start
   # echo "Streamsets installed - browse to http://`hostname -f`:18630/"

   echo "Compiling Scala programs needed for the demo"
   wget -q http://mirrors.koehn.com/apache/maven/maven-3/3.3.9/binaries/apache-maven-3.3.9-bin.tar.gz
   tar -zxf apache-maven-3.3.9-bin.tar.gz
   export JAVA_HOME=$(readlink -e /usr/java/default)
   export PATH=$PATH:`pwd`/apache-maven-3.3.9/bin:$JAVA_HOME/bin
   echo " ... copying Connected Car demo directory"
   mkdir -p demos
   hdfs dfs -copyToLocal -p s3a://gregoryg/demos/ConnectedCarDemo demos/ConnectedCarDemo
   cd demos/ConnectedCarDemo/demo/entity360
   mvn clean package
   cd bin/
   # cmhost, data collector host
   # zkhost=$(curl -u "admin:admin" "http://$cmhost:7180/api/v14/hosts?view=FULL" | jq -r '[.items[] | select(.roleRefs[].roleName | contains("ZOOKEEPER")) | .ipAddress] | first')
   echo "Set up Jupyter notebook because notebooks are cool"
   echo "And now update .bashrc"
   tee -a ~/.bashrc <<EOF
   # set environment variables for pyspark
   export PYSPARK_DRIVER_PYTHON=/opt/cloudera/parcels/Anaconda/bin/jupyter
   export PYSPARK_DRIVER_PYTHON_OPTS="notebook --NotebookApp.open_browser=False --NotebookApp.ip='*' --NotebookApp.port=8880"
   export PYSPARK_PYTHON=/opt/cloudera/parcels/Anaconda/bin/python
   export PATH=/opt/cloudera/parcels/Anaconda/bin:$PATH:~/bin

   EOF
   echo "TODO: add env var to all nodes, including this gateway"
   ## export PYSPARK_PYTHON=/opt/cloudera/parcels/Anaconda/bin/python

   echo "Downloading Jupyter notebook directory and starting Jupyter"
   hdfs dfs -copyToLocal s3a://gregoryg/notebooks .
   (cd notebooks ; nohup pyspark2 &)


   echo 'All done!'
 #+END_SRC
**** Hive benchmark dataset with User visits and website rankings
 #+BEGIN_SRC sql :results none :tangle ingest/impala/99-setup-hive-benchmark.sql :comments link
   -- LOCATION $sudouser
   create database hivebench;

   use hivebench;

   create external table rankings_raw
          (
           pageURL VARCHAR(300),
           pageRank INT,
           avgDuration INT
           )
           ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
          LOCATION 's3a://gregoryg/bigtest/rankings/';
           -- LOCATION '${var:USERDIR}/data/bigtest/rankings/';

   create external table uservisits_raw
          (
          sourceIP VARCHAR(116),
          destURL VARCHAR(100),
          visitDate timestamp,
          adRevenue FLOAT,
          userAgent VARCHAR(256),
          countryCode CHAR(3),
          languageCode CHAR(6),
          searchWord VARCHAR(32),
          duration INT
          )
          ROW FORMAT DELIMITED FIELDS TERMINATED BY ','
          LOCATION 's3a://gregoryg/bigtest/uservisits/';
          -- LOCATION '${var:USERDIR}/data/bigtest/uservisits/';

   create table uservisits stored as parquet as select * FROM uservisits_raw;

   create table rankings stored as parquet as select * FROM rankings_raw;
 #+END_SRC

